import styles from '../styles/Search.module.css'

export function Search(){
    return(
        <>
        <container>
        <div className= {styles.center}>
        <input></input> <button>텍스트 검색</button> <button>사진 검색</button>
        </div>
        <p><img className={styles.img} src="http://image.kyobobook.co.kr/images/book/large/225/l9791191114225.jpg"/>
        작별인사 김영하 복복서가 12,600원 | eBook 10,000원
        </p>
        <p><img className={styles.img} src="http://image.kyobobook.co.kr/images/book/large/610/l9788972773610.jpg"/>
        컬러애 물들다 밥 햄블리 리드리드 16,800원 | eBook 15,120원
        </p>
        <p><img className={styles.img} src="http://image.kyobobook.co.kr/images/book/large/665/l9791166686665.jpg"/>
        저주토끼 정보라 아작 14,800원 | eBook 13,320원
        </p>
        </container>

        <div className= {styles.center}>
        <input></input> <button>텍스트 검색</button> <button>사진 검색</button>
        </div>
        <p className= {styles.box}>
        <div float="left">
        <img className={styles.img} src="http://image.kyobobook.co.kr/images/book/large/225/l9791191114225.jpg"/>
        작별인사 소설
        김영하 복복서가 12,600원 | eBook 10,000원
        <button>바로 구매하기</button>
        <img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSMMhN1PFLJJXvnXemx_NSWl83TM_OcORAKbw&usqp=CAU"></img>
        </div>
        </p>
        <p> <button>책 정보</button> <button>지도 자세히 보기</button></p>
        <div className= {styles.box}>
ISBN	9791191114225(1191114228)
쪽수	308쪽
크기	134 * 196 * 31 mm /503g
책소개
이 책이 속한 분야
소설 | 한국소설 | 한국소설일반
이 책의 주제어
#미래사회 #수용소 #소속감 #우정 #여정 #탈출
누구도 도와줄 수 없는 상황, 혼자 헤쳐나가야 한다
지켜야 할 약속, 붙잡고 싶은 온기
김영하가 『살인자의 기억법』 이후 9 년 만에 내놓는 장편소설 『작별인사』는 그리 멀지 않은 미래를 배경으로, 별안간 삶이 송두리째 뒤흔들린 한 소년의 여정을 좇는다. 유명한 IT 기업의 연구원인 아버지와 쾌적하고 평화롭게 살아가던 철이는 어느날 갑자기 수용소로 끌려가 난생처음 날것의 감정으로 가득한 혼돈의 세계에 맞닥뜨리게 되면서 정신적, 신체적 위기에 직면한다. 동시에 자신처럼 사회에서 배제된 자들을 만나 처음으로 생생한 소속감을 느끼고 따뜻한 우정도 싹틔운다. 철이는 그들과 함께 수용소를 탈출하여 집으로 돌아가기 위해 길을 떠나지만 그 여정에는 피할 수 없는 질문이 기다리고 있다.

세계보건기구 WHO가 팬데믹을 선언한 지 2년이 지나서야 작가는 『작별인사』의 개작을 마쳤다. 420매 분량이던 원고는 약 800매로 늘었고, 주제도 완전히 달라졌다. ‘인간을 인간으로 만드는 것은 무엇인가?’, ‘인간과 인간이 아닌 존재들을 가르는 경계는 어디인가’를 묻던 소설은 ‘삶이란 과연 계속될 가치가 있는 것인가?’, ‘세상에 만연한 고통을 어떻게 하면 줄일 수 있을 것인가’, ‘어쩔 수 없이 태어났다면 어떻게 살고 어떻게 죽어야 할 것인가’와 같은 질문을 던지는 이야기로 바뀌었다. 팬데믹이 개작에 영향을 주었을 수도 있고, 원래 『작별인사』의 구상에 담긴 어떤 맹아가 오랜 개작을 거치며 발아했는지도 모른다. 그것에 대해 작가는 이렇게 말하고 있다.

마치 제목이 어떤 마력이 있어서 나로 하여금 자기에게 어울리는 이야기로 다시 쓰도록 한 것 같은 느낌이다. 탈고를 하고 얼마 지나지 않아 원고를 다시 읽어보았다. 이제야 비로소 애초에 내가 쓰려고 했던 어떤 것이 제대로, 남김 없이 다 흘러나왔다는 생각이 들었다. _’작가의 말’에서

전면적인 수정을 통해 2022년의 『작별인사』는 2020년의 『작별인사』를 마치 시놉시스나 초고처럼 보이게 할 정도로 확연하게 달라졌다. 그리고 김영하의 이전 문학 세계와의 연결점들이 분명해졌다.
저자소개
김영하
저자 : 김영하작가 정보 관심작가 등록
현대문학가＞소설가
소설가. 장편소설로 『살인자의 기억법』 『너의 목소리가 들려』 『퀴즈쇼』 『빛의 제국』 『검은 꽃』 『아랑은 왜』 『나는 나를 파괴할 권리가 있다』, 소설집으로 『오직 두 사람』 『무슨 일이... 더보기
김영하의 다른 작품
빛의 제국
빛의 제국
10,800원
나는 나를 파괴할 권리가 있다
나는 나를 파괴할 권리가 있다
10,350원
오직 두 사람(큰글자책)
오직 두 사람(큰글자책)
16,200원
다다다(양장본 HardCover)
다다다(양장본 HardCover)
29,700원
이전 상품다음 상품
목차
직박구리를 _묻어주던 _날 _11
당신은 _우리와 _함께 _가야 _합니다 _23
바깥이 _있었다 _41
사람으로 _산다는 _것 _53
사용감 _71
실패한 _쇼핑의 _증거 _89
탈출 _101
꿈에서 _본 _풍경 _115
겨울 _호수와 _물수리 _129
달마 _137
재판 _171
끝이 _오면 _알 _수 _있어 _189
몸속의 _스위치 _205
기계의 _시간 _217
고양이가 _되다 _233
순수한 _의식 _239
아빠의 _마음에 _찾아온 _평화 _253
신선 _263
마지막 _인간 _271
작가의 말 299
        </div>



        </> 
    )
}